problem link: https://leetcode.com/problems/nth-highest-salary/description/?lang=pythondata

In [2]:
import pandas as pd

### Generating test cases

In [3]:
# employee=pd.read_csv('./test_data/employee_test1_p176.csv',delimiter='|')
# employee=pd.read_csv('./test_data/employee_test2_p176.csv',delimiter='|')
employee=pd.read_csv('./test_data/employee_test3_p176.csv',delimiter='|')
employee

   id  salary
0   1     100
1   2     100

In [4]:
employee.dtypes

id        int64
salary    int64
dtype: object

In [5]:
employee.columns

Index(['id', 'salary'], dtype='object')

### Solving problem

In [6]:
employee=employee.drop(columns=['id']).drop_duplicates()  #removing duplicates
employee

   salary
0     100

In [7]:
employee=employee.sort_values(by='salary',ascending=False).reset_index(drop=True)   #descending sorting and reseting index so that our result can be found from n-1th index. Ex: 2nd highest salary will be found in 1st index

In [8]:
N=2    #need to find nth index
result=employee[employee.index==N-1].salary.rename(f'getNthHighestSalary({N})')    #getting n-1 index
result

Series([], Name: getNthHighestSalary(2), dtype: int64)

In [9]:
len(result)

0

In [10]:
import numpy as np

In [11]:
if len(result)>0:
    result=pd.DataFrame(result)
else:
    result=pd.DataFrame({f'getNthHighestSalary({N})': pd.Series(np.nan)})

In [12]:
result

   getNthHighestSalary(2)
0                     NaN

### Preparing Submission function

In [13]:
import pandas as pd
import numpy as np

def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    employee=employee.drop(columns=['id']).drop_duplicates()  #removing duplicates
    employee=employee.sort_values(by='salary',ascending=False).reset_index(drop=True)   #descending sorting and reseting index so that our result can be found in n-1th index. Ex: 2nd highest salary will be found in 1st index
    result=employee[employee.index==N-1].salary.rename(f'getNthHighestSalary({N})')    #getting n-1th index
    
    if len(result)>0:
        return pd.DataFrame(result)
    else:
        return pd.DataFrame({f'getNthHighestSalary({N})': pd.Series(np.nan)})

### Testing the submission function

In [20]:
employee=pd.read_csv('./test_data/employee_test1_p176.csv',delimiter='|')
# employee=pd.read_csv('./test_data/employee_test2_p176.csv',delimiter='|')
# employee=pd.read_csv('./test_data/employee_test3_p176.csv',delimiter='|')
employee

   id  salary
0   1     100
1   2     200
2   3     300

In [21]:
nth_highest_salary(employee=employee,N=2)

   getNthHighestSalary(2)
1                     200